micropython/micropython/ports/esp32/boards/SEEED_XIAO_ESP32S3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Seeed XIAO ESP32S3"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"

// REPL is on the native USB-CDC interface; the hardware UART is left free for
// the application. To put the REPL on UART0, define MICROPY_HW_ENABLE_UART_REPL.

#define MICROPY_HW_I2C0_SCL  (6)
#define MICROPY_HW_I2C0_SDA  (5)

#define MICROPY_HW_SPI1_MOSI (9)
#define MICROPY_HW_SPI1_MISO (8)
#define MICROPY_HW_SPI1_SCK  (7)

// microSD (Sense expansion board) in SPI mode: machine.SDCard(slot=2).
#define MICROPY_HW_SDCARD_SPI_MOSI (9)
#define MICROPY_HW_SDCARD_SPI_MISO (8)
#define MICROPY_HW_SDCARD_SPI_SCK  (7)
#define MICROPY_HW_SDCARD_SPI_CS   (21)

// The same microSD via native SD/MMC (1-bit): machine.SDCard(slot=1, width=1).
// Noticeably faster than SPI (esp. reads). The slot is SPI-wired, so only D0 is
// available (1-bit): CLK=SPI SCK, CMD=SPI MOSI, D0=SPI MISO.
#define MICROPY_HW_SDMMC_CLK       (7)
#define MICROPY_HW_SDMMC_CMD       (9)
#define MICROPY_HW_SDMMC_D0        (8)
